app/views/lists/show.html.erb

      </li> -->
      <% @list.items.each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."list_id" = ?  [["list_id", 3]]