app/controllers/items_controller.rb

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "items" ("description", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "milk"], ["list_id", 3], ["created_at", "2017-10-03 19:56:28.026324"], ["updated_at", "2017-10-03 19:56:28.026324"]]
---
  def create
    @list = List.find(params[:list_id])
    # this item is already associated with a list via URL
    # raise @list.inspect #finding the parent
    @item = @list.items.build(item_params)
    if @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "items" SET "status" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["status", 1], ["updated_at", "2017-10-03 22:43:47.105669"], ["id", 6]]
---
  def update
    # raise params.inspect #the data the form submitted to use that data to update the item described in the URL
    @item = Item.find(params[:id])
    @item.update(item_params) # add :status to strong params and clean up below 2 lines of code into this 1 line

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 6]]
---
  def destroy
    @item = Item.find(params[:id])
    @item.destroy