app/controllers/lists_controller.rb

  def index
    # why an instance variable? because it can permeate through controller to the erb views
    @list = List.new
    @lists = List.all
---
SELECT "lists".* FROM "lists"

  def show
    # I need to load the list
    # params have all the data passed on by the user
    @list = List.find(params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 1]]

  def create
    # why can't we use @list in #index action? they are completely different objects, entirely new request
    # need to instantiate a new @list
    @list = List.new(list_params)
    if @list.save
      # with redirects, should use full url instead of list_path
      redirect_to list_url(@list)
    else
      @lists = List.all
---
INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "After I press Enter I should be on this list"], ["created_at", "2017-10-03 18:30:02.954872"], ["updated_at", "2017-10-03 18:30:02.954872"]]
SELECT "lists".* FROM "lists"